/* 
  MapStatusPopoverView.strings
  Little Snitch Configuration

  Created by Erich Marth on 2013-01-29.
  Copyright (c) 2013 Objective Development Software GmbH. All rights reserved.
*/

// buttons
"OpenLSPreferences" = "Open Little Snitch Preferences";
"OpenSystemPreferences" = "Open System Preferences > Privacy";
"SearchForRules" = "Search Rules";

// map loading errors
"MapLoadingProblem_Title" = "Map could not be loaded";
"MapLoadingProblem_Description" = "The map showing the location of this network could not be loaded. This can either be caused by a deny rule blocking Little Snitch Configuration from accessing the map provider, or connecting to the provider is currently not possible.";

// title & informative error text
"notYetUpdated_Title" = "Location not yet determined";
"notYetUpdated_Description" = "The location of this network has not yet been determined.";

"unavailable_FeatureDisabled_Title" = "Saving of locations was disabled";
"unavailable_FeatureDisabled_Description" = "The last time your computer connected to this network, the location was not determined because the “Save location of networks” option was disabled in Little Snitch Preferences.";

"unavailable_LocationServicesDenied_Title" = "Location update was denied";
"unavailable_LocationServicesDenied_Description" = "The last time your computer connected to this network, the location could not be determined because Location Services were disabled for Little Snitch in System Preferences > Privacy.";

"unavailable_LocationServicesDisabled_Title" = "Location Services were disabled";
"unavailable_LocationServicesDisabled_Description" = "The last time your computer connected to this network, the location could not be determined, because Location Services were disabled in System Preferences > Privacy.";

"generalUpdateError_Title" = "Location could not be determined";
"generalUpdateError_Description" = "The last time your computer connected to this network, the location could not be determined.";

// information location status texts
"LocationServicesDenied_AdditionalDescription" = "Currently Location Services are disabled for Little Snitch in System Preferences > Privacy, preventing Little Snitch from determining locations of joined networks.";
"LocationServicesDisabled_AdditionalDescription" = "Currently Location Services are disabled in System Preferences > Privacy, preventing Little Snitch from determining locations of joined networks.";
"SaveLocationDisabled_AdditionalDescription" = "Currently the “Save location of networks” option is turned off in Little Snitch Preferences, preventing Little Snitch from determining locations of joined networks.";
"UpdatesNextTime_AdditionalDescription" = "The next time your computer connects to this network the location information will be updated automatically.";
